Bunkering_08/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          diagonal;
    }

    p_rgh
    {
/*
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.0;     // force iterations, do not early-exit
        smoother        DICGaussSeidel;
        nCellsInCoarsestLevel 50;
        minIter 1;     // <- VERY IMPORTANT
*/
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-6;
        relTol           0.0;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance        1e-6;
        relTol           0;     // no early exit on final correction
    }

    "(U|h|k|epsilon|omega)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.0;
        minIter 1;     // <- VERY IMPORTANT
    }

    "(U|h|k|epsilon|omega)Final"
    {
        $U;
        tolerance       1e-6;
        relTol          0;
    }

    Yi
    {
        $hFinal;
    }

    Phi
    {
        $p_rgh;
    }
}

PIMPLE
{
    momentumPredictor on; //off;
    nOuterCorrectors 8; //5; //3; //1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 2; //1; 


    residualControl
    {
        // Absolute stopping criteria (tolerance) + relative (relTol)
        p_rgh
        {
            tolerance   1e-4;
            relTol      0.0;   // 0.0 = force absolute stopping criterion
        }
        U
        {
            tolerance   1e-5;
            relTol      0.0;
        }
        h
        {
            tolerance   1e-6;
            relTol      0.0;
        }
        "(H2|O2|H2O|N2)"
        {
            tolerance   1e-6;
            relTol      0.0;
        }
    }
}


potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    equations
    {
        "(U|k|epsilon|h|H2|O2|H2O|N2|p_rgh)"         0.7;
        "(U|k|epsilon|h|H2|O2|H2O|N2|p_rgh)Final"    0.7;
    }
}
// ************************************************************************* //
